Ran Plan for dir: `opentofu` workspace: `prod`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/tofu plan -input=false -refresh -out "/atlantis-data/repos/opentoucan/infrastructure-config/6/prod/opentofu/prod-prod.tfplan" -var-file ./env/prod.tfvars -var environment=prod -var-file /atlantis-data/repos/opentoucan/infrastructure-config/6/prod/opentofu/env/prod.tfvars' in '/atlantis-data/repos/opentoucan/infrastructure-config/6/prod/opentofu': exit status 1
data.mongodbatlas_roles_org_id.org: Reading...
module.s3.minio_s3_bucket.bucket["prod-discord-409696112144810014"]: Refreshing state... [id=prod-discord-409696112144810014]
module.hetzner-vps.hcloud_ssh_key.ssh_key["ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHz/h+WzkR+AZYNvfzdbp/lUFIqdew+xErtSirm1XhPS"]: Refreshing state... [id=29065654]
module.hetzner-vps.data.hcloud_datacenters.all: Reading...
module.hetzner-vps.hcloud_firewall.firewall: Refreshing state... [id=2127713]
module.hetzner-vps.data.hcloud_datacenters.all: Read complete after 0s [id=5dd4ebdac62609c834f7768f02286b798bd82a38]
data.mongodbatlas_roles_org_id.org: Read complete after 0s [id=658b082bf98c657b2c969a5b]
data.mongodbatlas_team.teams["devops"]: Reading...
data.mongodbatlas_team.teams["developers"]: Reading...
data.mongodbatlas_team.teams["developers"]: Read complete after 1s [id=aWQ=:NjVkNGEzYmVlNTA3ODQwNTY3OGJiZmUz-b3JnX2lk:NjU4YjA4MmJmOThjNjU3YjJjOTY5YTVi]
data.mongodbatlas_team.teams["devops"]: Read complete after 1s [id=aWQ=:NjVkNGY1MTdlMDk4OTM3NDY2ZmEzZTdm-b3JnX2lk:NjU4YjA4MmJmOThjNjU3YjJjOTY5YTVi]
module.mongodb.mongodbatlas_project.project: Refreshing state... [id=65d4a3bf160f504f2547c2cd]
module.mongodb.mongodbatlas_project_ip_access_list.ip_access_list["0.0.0.0/0"]: Refreshing state... [id=ZW50cnk=:MC4wLjAuMC8w-cHJvamVjdF9pZA==:NjVkNGEzYmYxNjBmNTA0ZjI1NDdjMmNk]
module.mongodb.mongodbatlas_cluster.cluster["discord-bot"]: Refreshing state... [id=Y2x1c3Rlcl9pZA==:NjVkNGI3ODEzMTkxN2EwYzE0MThjZjVj-Y2x1c3Rlcl9uYW1l:ZGlzY29yZC1ib3Q=-cHJvamVjdF9pZA==:NjVkNGEzYmYxNjBmNTA0ZjI1NDdjMmNk-cHJvdmlkZXJfbmFtZQ==:VEVOQU5U]
╷
│ Error: Invalid object key

│ 
│   on modules/hetzner-vps/locals.tf line 2, in locals:
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
│    2:   datacentres = { for dc in data.hcloud_datacenters.all.datacenters : dc.location => dc }
│     ├────────────────
  + create

OpenTofu planned the following actions, but then encountered a problem:
│     │ dc.location is map of string with 7 elements

  # module.hetzner-vps.hcloud_primary_ip.primary_ip will be created
│ 
  + resource "hcloud_primary_ip" "primary_ip" {
│ The key expression produced an invalid result: string required.
      + assignee_id       = (known after apply)
╵
      + assignee_type     = "server"
      + auto_delete       = false
      + datacenter        = (known after apply)
      + delete_protection = false
      + id                = (known after apply)
      + ip_address        = (known after apply)
      + ip_network        = (known after apply)
      + name              = "primary_ip"
      + type              = "ipv4"
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```
</details>